Функция КлиентOidc(ПараметрыКлиента, ОписаниеОповещенияОЗакрытии = Неопределено) Экспорт
	
	ПространствоИмен = "Авторизатор";
	ИмяФормы = СтрШаблон("Обработка.%1.Форма.КлиентАвторизации", ПространствоИмен);
	
	Результат = ПолучитьФорму(ИмяФормы, ПараметрыКлиента);
	
	Если ОписаниеОповещенияОЗакрытии <> Неопределено Тогда
		Результат.ОписаниеОповещенияОЗакрытии = ОписаниеОповещенияОЗакрытии;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОпределенияПараметрыАвторизатора() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ИмяПриложения");
	Результат.Вставить("КлючПриложения");
	Результат.Вставить("Скоупы");
	Результат.Вставить("_ХостIdentity");
	
	Возврат Результат;
	
КонецФункции